import { Component } from '@angular/core';
import { environment } from 'src/environments/environment';

@Component({
  selector: 'app-services-section',
  templateUrl: './services-section.component.html',
  styleUrls: ['./services-section.component.scss']
})
export class ServicesSectionComponent {
  assetsPath = environment.imgAssetsPath + '/landing/services';
  servicesCardsContents = [
    {
      title: 'الماده العلمية',
      text: 'يتفاعل الطلاب مع المعلم بالكتابة والصوت وحل الأسئلة والاختبارات .. ويصل للمعلم تقرير كامل عن تفاعلهم يتفاعل الطلاب مع المعلم بالكتابة والصوت وحل الأسئلة والاختبارات .. ويصل للمعلم تقرير كامل عن تفاعلهم!',
      imgName: '/book.svg'
    },
    {
      title: 'امتحانات دورية',
      text: 'يتفاعل الطلاب مع المعلم بالكتابة والصوت وحل الأسئلة والاختبارات .. ويصل للمعلم تقرير كامل عن تفاعلهم يتفاعل الطلاب مع المعلم بالكتابة والصوت وحل الأسئلة والاختبارات .. ويصل للمعلم تقرير كامل عن تفاعلهم!',
      imgName: '/test.svg'
    },
    {
      title: 'معلومات عن المعلم',
      text: 'يتفاعل الطلاب مع المعلم بالكتابة والصوت وحل الأسئلة والاختبارات .. ويصل للمعلم تقرير كامل عن تفاعلهم يتفاعل الطلاب مع المعلم بالكتابة والصوت وحل الأسئلة والاختبارات .. ويصل للمعلم تقرير كامل عن تفاعلهم!',
      imgName: '/teacher.svg'
    },
    {
      title: 'اختبر مهاراتك',
      text: 'يتفاعل الطلاب مع المعلم بالكتابة والصوت وحل الأسئلة والاختبارات .. ويصل للمعلم تقرير كامل عن تفاعلهم يتفاعل الطلاب مع المعلم بالكتابة والصوت وحل الأسئلة والاختبارات .. ويصل للمعلم تقرير كامل عن تفاعلهم!',
      imgName: '/lightbulb.svg'
    },
    {
      title: 'لغات متعددة',
      text: 'يتفاعل الطلاب مع المعلم بالكتابة والصوت وحل الأسئلة والاختبارات .. ويصل للمعلم تقرير كامل عن تفاعلهم يتفاعل الطلاب مع المعلم بالكتابة والصوت وحل الأسئلة والاختبارات .. ويصل للمعلم تقرير كامل عن تفاعلهم!',
      imgName: '/languages.svg'
    },
    {
      title: 'الاباء',
      text: 'يتفاعل الطلاب مع المعلم بالكتابة والصوت وحل الأسئلة والاختبارات .. ويصل للمعلم تقرير كامل عن تفاعلهم يتفاعل الطلاب مع المعلم بالكتابة والصوت وحل الأسئلة والاختبارات .. ويصل للمعلم تقرير كامل عن تفاعلهم!',
      imgName: '/parents.svg'
    },
  ]
}
